---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTrayType
source: html/7ff5138f-5bd6-dbf4-3b57-7ee762bbd7af.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayType

This class represents a cable tray type in Autodesk Revit.

## Syntax (C#)
```csharp
public class CableTrayType : MEPCurveType
```